#+TITLE: Assembly of Three Kokia Genomes
# #+property: header-args            :var DIR=(file-name-directory (file-local-name buffer-file-name)) :exports none :eval never-export
# #+property: header-args:sh         :tangle (tangle-path) :var WORKING=(file-local-name (get-working-directory)) :prologue (org-sbe tools)
# #+property: header-args:shell      :tangle (tangle-path) :var WORKING=(file-local-name (get-working-directory)) :prologue (org-sbe tools)
# #+property: header-args:bash       :tangle (tangle-path) :var WORKING=(file-local-name (get-working-directory))
# #+property: header-args:python     :tangle (tangle-path) :var WORKING=(file-local-name (get-working-directory))
# #+property: header-args:R          :tangle (tangle-path) :var WORKING=(file-local-name (get-working-directory))
# #+property: header-args:lua        :tangle (tangle-path) :var WORKING=(file-local-name (get-working-directory))
# #+property: header-args:lst        :tangle (tangle-path)
# #+property: header-args:emacs-lisp :results silent

#+name: local-functions
#+begin_src emacs-lisp
(defun make-path (path &optional script)
  (let ((path (apply 'file-name-concat path)))
    (if script
        (expand-file-name script path)
      (expand-file-name path))))

(defun get-language (block)
  (org-element-property :language (org-element-context)))

(defun get-name ()
  (org-element-property :name (org-element-context)))

(defun get-extension ()
  (alist-get (get-language (get-name))
             '(("emacs-lisp" . "el")
               ("shell" . "sh")
               ("lua" . "lua")
               ("sh" . "sh")
               ("python" . "py")
               ("lst" . "lst")
               ("R" . "R")) "" nil 'string-equal))

(defun get-filename ()
  (expand-file-name (buffer-file-name) (file-name-directory buffer-file-name)))

(defun make-name ()
  (format "%s.%s" (get-name) (get-extension)))

(defun tangle-path ()
  (string-replace " " "_" (make-path (org-get-outline-path t) (make-name))))

* Kokia drynarioides JFW-HI

#+name: assembly-stages-kd
| Kokia_drynarioides_JFW-HI/1-contigs/canu.contigs.fasta                |
| Kokia_drynarioides_JFW-HI/2-hic-scaffold/yahs/yahs_scaffolds_final.fa |
| Kokia_drynarioides_JFW-HI/3-curate/assembly_curated/assembly.fasta    |

#+call: abyss-summary(genome=(org-sbe genome-string (genomes assembly-stages-kd)))

#+RESULTS:
| name   | 1-contigs | 2-hic-scaffold | 3-curate |
|--------+-----------+----------------+----------|
| n      |      2365 |           1548 |       12 |
| n:500  |      2365 |           1548 |       12 |
| L50    |        89 |              5 |        6 |
| min    |      1206 |           1000 |  35.77e6 |
| N75    |    755687 |         37.1e6 |  38.09e6 |
| N50    |   1659488 |        49.21e6 |  40.49e6 |
| N25    |   3113363 |         78.8e6 |  48.17e6 |
| E-size |   2550534 |        52.09e6 |  43.67e6 |
| max    |   11.36e6 |        86.03e6 |  59.06e6 |
| sum    |   552.8e6 |        552.8e6 |  511.8e6 |
#+tblfm: @2$2..@>$>=$0;e4

#+name: annex
#+begin_src shell :var data=assembly-stages-kd
for FILE in "${data[@]}"; do
    FILE=$(echo $FILE | sed -e 's/Kokia_drynarioides_JFW-HI\///')
    echo $FILE
    gzip $FILE
    git annex add $FILE.gz
done
#+end_src


*** Hi-C Scaffolding
- Create bwa database for assembly
  #+begin_src sh :tangle kd/2-hic/0-ref/run.sh
ROOT=$(git rev-parse --show-toplevel)

ml singularity/3.7.3
bwa () {
    singularity exec -B $ROOT \
        /apps/singularity-3/bwa/bwa-0.7.17.sif bwa $@
}
samtools () {
    singularity exec -B $ROOT \
        /apps/singularity-3/samtools/samtools-v1.9-4-deb_cv1.sif \
        samtools $@
}

bwa index -a bwtsw -p $DIR/kd/2-hic/0-ref/kd.bwa $DIR/kd/canu.contigs.fasta
samtools faidx $DIR/kd/canu.contigs.fasta
  #+end_src
- Align Hi-C data to assembly
  #+header: :var data=../0-raw/readme.org:kd-hic
  #+begin_src sh :tangle kd/2-hic/1-bwa/run.sh
ROOT=$(git rev-parse --show-toplevel)
RAW=$(realpath $DIR/../0-raw/)

ml singularity/3.7.3
bwa () {
    singularity exec -B $ROOT \
        /apps/singularity-3/bwa/bwa-0.7.17.sif bwa $@
}
samtools () {
    singularity exec -B $ROOT \
        /apps/singularity-3/samtools/samtools-v1.9-4-deb_cv1.sif \
        samtools $@
}
PATH=$PATH:$DIR/apps/samblaster

for name in "${!data[@]}"; do
    readarray -t libs <<< "${data[$name]}"

    bwa mem -5SP -t 24 $DIR/kd/2-hic/0-ref/kd.bwa $RAW/${libs[0]} $RAW/${libs[1]} |
        samblaster |
        samtools view -bS -F 2316 > $DIR/kd/2-hic/1-bwa/$name.bam
done

  #+end_src

- Validate libraries
  #+header: :var data=../0-raw/readme.org:kd-hic
  #+begin_src sh :tangle 2-hic/2-qc/run.sh
ROOT=$(git rev-parse --show-toplevel)

ml python/3.9.2
export PYTHONPATH=$PYTHONPATH:~/.local/lib/python3.9/site-packages/
source $DIR/apps/hic_qc/bin/activate

for name in "${!data[@]}"; do
    $DIR/apps/hic_qc/hic_qc.py \
        -b $DIR/2-hic/1-bwa/$name.bam \
        -o $DIR/2-hic/2-qc/$name \
        --lib_enzyme GATC
done

  #+end_src

- Convert bams to single bed
  #+header: :var data=../0-raw/readme.org:kd-hic[,0]
  #+begin_src sh :tangle kd/2-hic/3-convert.sh
ROOT=$(git rev-parse --show-toplevel)

ml singularity/3.7.3
bedtools () {
    singularity exec -B $ROOT \
        /apps/singularity-3/bedtools/bedtools-2.28.0.sif bedtools $@
}

export ROOT DIR
export -f bedtools

parallel --eta bedtools bamtobed -i $DIR/kd/2-hic/1-bwa/{}.bam \
    ::: "${data[@]}" > $DIR/kd/2-hic/3-alignments.bed
  #+end_src
- Run SALSA
  #+begin_src sh :tangle kd/2-hic/4-salsa/run.sh
ROOT=$(git rev-parse --show-toplevel)

ml singularity/3.7.3

singularity exec -B $ROOT $DIR/apps/salsa2_2.3--py27h16ec135_1.sif \
    run_pipeline.py \
    -i 15 \
    -a $DIR/kd/canu.contigs.fasta \
    -l $DIR/kd/canu.contigs.fasta.fai \
    -b $DIR/kd/2-hic/3-alignments.bed \
    -e GATC \
    -s 590000000 \
    -o $DIR/kd/2-hic/4-salsa/ \
    -p yes
  #+end_src

  #+begin_src sh :tangle kd/2-hic/4-salsa/stat.sh
ROOT=$(git rev-parse --show-toplevel)

ml singularity/3.7.3

singularity exec -B $ROOT \
    /apps/singularity-3/abyss/abyss-v2.1.5-7-deb_cv1.sif \
    /usr/lib/abyss/abyss-fac \
    $DIR/kd/2-hic/4-salsa/scaffolds_ITERATION_*.fasta \
    $DIR/kd/2-hic/4-salsa/scaffolds_FINAL.fasta


  #+end_src

  #+RESULTS:
  |    n | n:500 | L50 |  min |     N75 |     N50 |     N25 |  E-size |        max |         sum |  name |
  | 1832 |  1832 |  48 | 1197 | 1337726 | 3293652 | 5573229 | 4604924 | 22950000.0 | 551100000.0 |     1 |
  | 1663 |  1663 |  46 | 1197 | 1455819 | 3362451 | 6249823 | 4727382 | 22950000.0 | 551100000.0 |     2 |
  | 1596 |  1596 |  45 | 1197 | 1680764 | 3702737 | 6262271 | 4841897 | 22950000.0 | 551100000.0 |     3 |
  | 1571 |  1571 |  43 | 1197 | 1722624 | 3786187 | 6299587 | 4959276 | 22950000.0 | 551100000.0 |     4 |
  | 1596 |  1596 |  45 | 1197 | 1680764 | 3702737 | 6262271 | 4841897 | 22950000.0 | 551100000.0 | FINAL |


- dotplot against kirkii

  #+begin_src sh
ml minimap2/2.17 r/4.0.25

cd $DIR/kd/

minimap2 -x asm5 -t 20 \
    $DIR/0-ref/kirkii.fa $DIR/kd/2-hic/4-salsa/scaffolds_ITERATION_4.fasta \
    > $DIR/kd/hic.kirkii.paf

Rscript $DIR/apps/dotplots/pafCoordsDotPlotly.R -i $DIR/kd/hic.kirkii.paf \
    -o hic.kirkii -m 20000 -x -s -t -l -p 12
  #+end_src
* Kokia kauaiensis S9

#+name: assembly-stages-kk
| Kokia_kauaiensis_S9/1-contigs/genome.hic.p_ctg.fa               |
| Kokia_kauaiensis_S9/2-polish/consensus.fasta                    |
| Kokia_kauaiensis_S9/3-arrange/ragtag.merge.fasta                |
| Kokia_kauaiensis_S9/4-salsa/salsa/scaffolds_FINAL.fasta         |
| Kokia_kauaiensis_S9/5-hic-scaffold/yahs/yahs_scaffolds_final.fa |
| Kokia_kauaiensis_S9/6-curate/assembly_curated/assembly.fasta    |

#+call: abyss-summary(genome=(org-sbe genome-string (genomes assembly-stages-kk)))

#+RESULTS:
| name   | 1-contigs | 2-polish | 3-arrange | 4-salsa | 5-hic-scaffold | 6-curate |
|--------+-----------+----------+-----------+---------+----------------+----------|
| n      |      1990 |     1990 |      1698 |    1313 |           1448 |       12 |
| n:500  |      1990 |     1990 |      1698 |    1313 |           1444 |       12 |
| L50    |       111 |      111 |        51 |       7 |              5 |        6 |
| min    |      2530 |     2529 |      2529 |    2529 |            597 |  36.81e6 |
| N75    |    776382 |   776726 |   2067120 | 8961706 |        39.44e6 |  40.22e6 |
| N50    |   1538110 |  1538567 |   3511082 | 24.34e6 |        41.43e6 |  40.62e6 |
| N25    |   2565855 |  2567210 |   5229284 | 42.28e6 |         48.6e6 |  50.85e6 |
| E-size |   1828249 |  1828802 |   4279582 | 30.12e6 |        51.76e6 |  44.86e6 |
| max    |   7124001 |  7124643 |   18.33e6 | 83.08e6 |        106.9e6 |  59.28e6 |
| sum    |   556.6e6 |  556.7e6 |   556.7e6 | 556.7e6 |        556.7e6 |  527.2e6 |
#+tblfm: @2$2..@>$>=$0;e4

#+name: annex
#+begin_src shell :var data=assembly-stages-kk
for FILE in "${data[@]}"; do
    FILE=$(echo $FILE | sed -e 's/Kokia_kauaiensis_S9\///')
    echo $FILE
    gzip $FILE
    git annex add $FILE.gz
done
#+end_src

* Kokia cookei C69

#+name: assembly-stages-kc
| Kokia_cookei_C69/1-contigs/genome.hic.p_ctg.fa               |
| Kokia_cookei_C69/2-polish/consensus.fasta                    |
| Kokia_cookei_C69/3-arrange/ragtag.merge.fasta                |
| Kokia_cookei_C69/4-salsa/salsa/scaffolds_FINAL.fasta         |
| Kokia_cookei_C69/5-hic-scaffold/yahs/yahs_scaffolds_final.fa |
| Kokia_cookei_C69/6-curate/assembly_curated/assembly.fasta    |

#+call: abyss-summary(genome=(org-sbe genome-string (genomes assembly-stages-kc)))

#+RESULTS:
| name   | 1-contigs | 2-polish | 3-arrange | 4-salsa | 5-hic-scaffold | 6-curate |
|--------+-----------+----------+-----------+---------+----------------+----------|
| n      |      2046 |     2046 |      1856 |    1520 |           1442 |       12 |
| n:500  |      2046 |     2046 |      1856 |    1520 |           1442 |       12 |
| L50    |        85 |       85 |        54 |      28 |              4 |        6 |
| min    |      1458 |     1465 |      1465 |    1465 |           1000 |  36.49e6 |
| N75    |   1012372 |  1012881 |   1852164 | 2233482 |        17.02e6 |  39.26e6 |
| N50    |   2046115 |  2046239 |   3372169 | 4586710 |        53.38e6 |  42.33e6 |
| N25    |   3400100 |  3401766 |   5196010 | 11.82e6 |        73.18e6 |  49.07e6 |
| E-size |   2411995 |  2412930 |   4071711 | 8821429 |        55.25e6 |  44.89e6 |
| max    |   8940624 |  8945492 |   16.73e6 | 38.94e6 |        121.3e6 |  57.92e6 |
| sum    |   567.7e6 |  567.8e6 |   567.8e6 | 567.8e6 |        567.8e6 |  527.9e6 |
#+tblfm: @2$2..@>$>=$0;e4

#+name: annex
#+begin_src shell :var data=assembly-stages-kc
for FILE in "${data[@]}"; do
    FILE=$(echo $FILE | sed -e 's/Kokia_cookei_C69\///')
    echo $FILE
    gzip $FILE
    git annex add $FILE.gz
done
#+end_src


